package Lesson_13;
/*Задания

1. Работа с параметрами запроса. Создать форму регистрации на почту (register.jsp).
Данная форма должна содержать следующие поля: имя, фамилия, e-mail.
При отправке формы отображается страница (result.jsp) с введенными данными.
2. Работа с атрибутами запроса. Создать две страницы: init.jsp, main.jsp.
Страница init.jsp создает двумерный массив размера 3х3.
Страница main.jsp включает страницу init.jsp, и отображает массив в виде html-таблицы.
3. Создать пакет personal. Добавить в него класс AboutMe, который имеет методы: getFirstName, getLastName.
Используя этот класс соответствующие данные через jsp-страницу.
4. Используя класс Arrays из пакета java.util выполнить сортировку массива.
Вывести начальный и отсортированный массивы на jsp-странице.
*/
public class Solution13 {
}
