package Lesson_12;
/*Задания
1. Создать страницу personal.html, которая содержит следующий вывод:
Имя: Ваше имя
Университет: Название вашего ВУЗа
Факультет: Название вашего факультета
Группа: Название вашей группы
2. Создать страницу personal.jsp, которая содержит:
Имя: Ваше имя
Университет: Название вашего ВУЗа
Факультет: Название вашего факультета
Группа: Название вашей группы
Для вывода использовать переменную out (out.print()).
3. Вывести эти же данные, но с использованием скриптлета вывода (<%= %>).
4. Создать массив со следующим содержимым:
1 2 3
4 5 6
7 8 9
Вывести массив на странице как HTML-таблицу. Использовать скриптлет вывода. */
public class Solution12 {
}
