package Lesson_2;
/**Задания

 1. Создайте программу Homer.java. Программа выводит на экран строку: «Hello! My name is Homer.»
 Откомпилируйте и выполните программу.
 */
public class Homer {
    public static void main(String[] args) {
        System.out.println("Hello! My name is Homer.");
    }
}
